1. Добавить формулу в "приседания" (та же что и на жиме)

2. После нажатия кнопки "создать таблицу" добавить тренировочную программу которая описана ниже.
"данные подсчета" - Данные которые посчитала программа.


Понедельник


Кардио 20 минут		
Приседания	"данные подсчета"	4 по 8
Жим лёжа 	"данные подсчета"	4 по 8
Разводка ган лежа		5 по 10
Трицепс два упражнения 		4 по 10
Тяга из ямы 5 см	87,50	4 по 6
Сгибание ног		4 по 10
Пресс

		
Среда		
Кардио 20 минут		
Присед с паузой в седе	87,50	4 по 6
Жим узким хватом	60,00	4 по 6
Тяга в наклоне		4 по 8
Тяга вер блока		4 по 10
Тяга гор блока		4 по 10
Жим стоя		4 по 8
Жим ган сидя		4 по 8
Махи ган в стороны		4 по 10
Махи в наклоне		4 по 10
Тяга с пола	110,00	4 по 8
Наклоны	45,00	4 по 8


Пятница		
Кардио 20 минут		
Присед ноги узко высокая закладка	100,00	4 по 5
Жим с паузой в 5 секунд	65,00	4 по 5
Бицепс со шт		4 по 8
Бицепс с ган		4по 10
Тяга с 2 остановками	110,00	4 по 5
Разгибание ног		4 по 10
Гиперэкстензии		4 по 15


2 неделя
		
Понедельник		
Кардио 20 минут		
Приседания	"данные подсчета"	4 по 8
Жим лёжа	"данные подсчета"	4 по 8
Жим гантелей		5 по 10
Трицепс два упражнения		4 по 10
Тяга из ямы 5 см	100,00	4 по 6
Сгибание ног		4 по 10
Пресс	

	
Среда		
Кардио 20 минут		
Присед с паузой в седе	100,00	4 по 6
Жим средним хватом	67,50	4 по 6
Тяга в наклоне с пола		4 по 8
Тяга вер блока		4 по 10
Тяга гор блока		4 по 10
Жим стоя		4 по 8
Жим ган сидя		4 по 8
Махи ган в стороны		4 по 10
Махи в наклоне		4 по 10
Тяга с пола	120,00	4 по 8
Наклоны	50,00	4 по 8


Пятница		
Кардио 20 минут		
Присед ноги узко высокая закладка	110,00	4 по 6
Жим с паузой в 3 секунды	72,50	4 по 6
Бицепс со штангой		4 по 8
Бицепс с гантелями		4по 10
Тяга с 2 остановками	120,00	4 по 5
Разгибание ног		4 по 10
Гиперэкстензии		4 по 15



3 неделя	

	
Понедельник		
Кардио 20 минут		
Приседания	"данные подсчета"	х 8
Жим лёжа 	"данные подсчета"	х 8
Разводка гантелей		5 по 10
Бицепс со штангой		4 по 8
Тяга из ямы	110,00	4 по 5
Сгибание ног		4 по 10
Пресс		


Среда		
Кардио 20 минут		
Присед с паузой в седе	110,00	4 по 5
Жим узким хватом	65,00	4 по 5
Тяга в наклоне с пола		4 по 8
Тяга вер блока		4 по 10
Тяга гор блока		4 по 10
Жим стоя		4 по 8
Жим ган сидя		4 по 8
Махи ган в стороны		4 по 10
Махи в наклоне		4 по 10
Тяга с пола	120,00	х8
Наклоны	55,00	4 по 6


Пятница		
Кардио 20 минут		
Присед медленно вниз	120,00	4 по 4
Жим лёжа с 2 остановками	72,50	4 по 4
Трицепс два упражнения		4 по 10
Тяга с подставок 10 см	110,00	х5
Разгибание ног		4 по 10
Гиперэкстензии		4 по 15


4 неделя		


Понедельник		
Кардио 20 минут		
Приседания	"данные подсчета"	х 6
Жим лёжа	"данные подсчета"	х 6
Жим гантелей лежа		5 по 10
Бицепс со штангой		4 по 8
Бицепс с гантелями		4 по 10
Тяга из ямы 5 см	120,00	4 по 5
Сгибание ног		4 по 10
Пресс		


Среда		
Кардио 20 минут		
Присед с паузой в седе	120,00	4 по 4
Жим средним хватом	72,50	4 по 4
Тяга в наклоне с пола		4 по 8
 Тяга вер блока		4 по 10
Тяга гор блока		4 по 10
Жим стоя		4 по 8
Жим ган сидя		4 по 8
Махи ган в стороны		4 по 10
Махи в наклоне		4 по 10
Тяга с пола	120,00	х6
Наклоны 	60,00	4 по 5


Пятница		
Кардио 20 минут		
Присед на тумбу	110,00	х5
Жим лёжа	65,00	х5
Трицепс два упражнения		4 по 10
Тяга с подставок 10 см	100,00	х5
Разгибание ног		4 по 10
Гиперэкстензии		4 по 15


5 неделя		


Понедельник		
Кардио 20 минут		
Приседания	"данные подсчета"	х 6
Жим лёжа	"данные подсчета"	х 6
Разводка ган лежа		5 по 10
Бицепс со штангой		4 по 8
Бицепс с гантелями		4 по 10
Тяга из ямы 5 см	110,00	х4 
Сгибание ног		4 по 10
Пресс		


Среда		
Кардио 20 минут		
Присед с паузой в седе	110,00	х4 
Жим узким хватом	82,50	4 по 3
Тяга в наклоне с виса		4 по 8
Тяга вер блока		4 по 10
Тяга гор блока		4 по 10
Жим стоя		4 по 8
Жим ган сидя		4 по 8
Махи ган в стороны		4 по 10
Махи в наклоне		4 по 10
Тяга с пола	110,00	х6
Наклоны	65,00	4 по 5


Пятница		
Кардио 20 минут		
Присед сумо	120,00	х3
Жим лёжа	72,50	х5
Трицепс два упражнения		4 по 10
Тяга с подставок 10 см	110,00	х5
Разгибание ног		4 по 10
Гиперэкстензии		4 по 15


6 неделя		

Понедельник		
Приседания	"данные подсчета"	х 6
Жим лёжа	"данные подсчета"	х 6
Жим гантелей на наклонной		4 по 10
Бицепс со штангой		4 по 8
Бицепс с гантелями		4 по 10
Тяга из ямы 5 см	120,00	х4 
Сгибание ног		4 по 10
Пресс		


Среда		
Присед с паузой в седе	120,00	х4 
Жим средним хватом	90,00	4 по 3
Тяга вер блока		4 по 10
Тяга гор блока		4 по 10
Жим гантелей сидя		4 по 8
Махи в стороны		4 по 10
Махи в наклоне		4 по 10
Тяга с пола	120,00	х6
Наклоны	72,50	4 по 4

Пятница  		
Присед ноги узко высокая закладка	110,00	х4 
Жим лёжа	80,00	х5
Трицепс два упражнения		4 по 10
Тяга с подставок 10 см	120,00	х5
Разгибание ног		4 по 10
Гиперэкстензии		4 по 15


7 неделя		

Понедельник		
Приседания	"данные подсчета"	х 6
Жим лёжа	"данные подсчета"	х 6
Разводка гантелей на наклонной		4 по 10
Бицепс с гантелями		4 по 10
Тяга из ямы 5 см	110,00	х4 
Сгибание ног		4 по 10
Пресс		


Среда		
Присед с паузой в седе	110,00	х4 
Жим с паузой в 3 секунды	95,00	4 по 2
Тяга гор блока		4 по 10
Тяга с пола	110,00	х 6
Наклоны	77,50	4 по 3


Пятница		
Присед ноги узко высокая закладка	120,00	х4 
Жим лёжа	72,50	х5
Трицепс		4 по 10
Тяга с подставок 10 см	132,50	х5
Разгибание ног		4 по 10
Гиперэкстензии		4 по 15


8 неделя		


Понедельник		
Приседания	"данные подсчета" х 5
Жим лёжа	"данные подсчета"	х 5
Жим гантелей лежа		4 по 10
Бицепс с гантелями		4 по 10
Сгибание ног		4 по 10
Пресс		


Среда		
Тяга с пола	120,00	х 5
Жим с паузой в 3 секунды	100,00	4 по 2
Жим ган сидя		4 по 8
Тяга с подставок 10 см	120,00	х 5
Наклоны	82,50	4 по 2


Пятница		
Присед с паузой	110,00	х5
Жим лёжа	65,00	х5
Трицепс		4 по 10
Разгибание ног		4 по 10
Гиперэкстензия		4 по 15


9 неделя	
	
Понедельник		
Приседания "данные подсчета"	х 5
Жим лёжа	"данные подсчета"	х 5
Разводка		4 по 10
Бицепс с гантелями		4 по 10
Сгибание ног		4 по 10
Пресс		


Среда		
Тяга с пола	110,00	х 5
Жим с паузой в 3 секунды	105,00	3 по 2
Тяга с подставок 10 см	175,00	х3
Наклоны	87,50	3 по 2
Пятница		
Присед с паузой	120,00	х4
Жим лёжа	72,50	х5
Трицепс		4 по 10
Разгибание ног		4 по 10
Гиперэкстензия		4 по 15


10 неделя	
	
Понедельник		
Приседания	"данные подсчета"	х 5
Жим лёжа	"данные подсчета"	х 5
Жим гантелей на наклонной		4 по 10
Бицепс с гантелями		4 по 10
Сгибание ног		4 по 10
Пресс		


Среда		
Тяга с пола	120,00	х 5
Жим с паузой в 3 секунды	110,00	3 по 1
Тяга с подставок 10 см	187,50	х2
Наклоны 	92,50	3 по 2


Пятница		
Присед с паузой	110,00	х5
Жим лёжа	65,00	х5
Трицепс		4 по 10
Разгибание ног		4 по 10
Гиперэкстензия		4 по 15
